Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/include/proc/p32mz2025dab169.h
#define _AUBADEVCFG4_w_POSITION                  0x00000000
#define _AUBADEVCFG4_w_MASK                      0xFFFFFFFF
#define _AUBADEVCFG4_w_LENGTH                    0x00000020

#define _AUBADEVCFG3_USERID_POSITION             0x00000000
#define _AUBADEVCFG3_USERID_MASK                 0x0000FFFF
#define _AUBADEVCFG3_USERID_LENGTH               0x00000010

#define _AUBADEVCFG3_FMIIEN_POSITION             0x00000018
#define _AUBADEVCFG3_FMIIEN_MASK                 0x01000000
#define _AUBADEVCFG3_FMIIEN_LENGTH               0x00000001

#define _AUBADEVCFG3_FETHIO_POSITION             0x00000019
#define _AUBADEVCFG3_FETHIO_MASK                 0x02000000
#define _AUBADEVCFG3_FETHIO_LENGTH               0x00000001

#define _AUBADEVCFG3_PGL1WAY_POSITION            0x0000001B
#define _AUBADEVCFG3_PGL1WAY_MASK                0x08000000
#define _AUBADEVCFG3_PGL1WAY_LENGTH              0x00000001

#define _AUBADEVCFG3_PMDL1WAY_POSITION           0x0000001C
#define _AUBADEVCFG3_PMDL1WAY_MASK               0x10000000
#define _AUBADEVCFG3_PMDL1WAY_LENGTH             0x00000001

#define _AUBADEVCFG3_IOL1WAY_POSITION            0x0000001D
#define _AUBADEVCFG3_IOL1WAY_MASK                0x20000000
#define _AUBADEVCFG3_IOL1WAY_LENGTH              0x00000001

#define _AUBADEVCFG3_w_POSITION                  0x00000000
#define _AUBADEVCFG3_w_MASK                      0xFFFFFFFF
#define _AUBADEVCFG3_w_LENGTH                    0x00000020

#define _AUBADEVCFG2_FPLLIDIV_POSITION           0x00000000
#define _AUBADEVCFG2_FPLLIDIV_MASK               0x00000007
#define _AUBADEVCFG2_FPLLIDIV_LENGTH             0x00000003

#define _AUBADEVCFG2_FPLLRNG_POSITION            0x00000004
#define _AUBADEVCFG2_FPLLRNG_MASK                0x00000070
#define _AUBADEVCFG2_FPLLRNG_LENGTH              0x00000003

#define _AUBADEVCFG2_FPLLICLK_POSITION           0x00000007
#define _AUBADEVCFG2_FPLLICLK_MASK               0x00000080
#define _AUBADEVCFG2_FPLLICLK_LENGTH             0x00000001

#define _AUBADEVCFG2_FPLLMULT_POSITION           0x00000008
#define _AUBADEVCFG2_FPLLMULT_MASK               0x00007F00
#define _AUBADEVCFG2_FPLLMULT_LENGTH             0x00000007

#define _AUBADEVCFG2_FPLLODIV_POSITION           0x00000010
#define _AUBADEVCFG2_FPLLODIV_MASK               0x00070000
#define _AUBADEVCFG2_FPLLODIV_LENGTH             0x00000003

#define _AUBADEVCFG2_VBATBOREN_POSITION          0x00000013
#define _AUBADEVCFG2_VBATBOREN_MASK              0x00080000
#define _AUBADEVCFG2_VBATBOREN_LENGTH            0x00000001

#define _AUBADEVCFG2_DSBOREN_POSITION            0x00000014
#define _AUBADEVCFG2_DSBOREN_MASK                0x00100000
#define _AUBADEVCFG2_DSBOREN_LENGTH              0x00000001

#define _AUBADEVCFG2_DSWDTPS_POSITION            0x00000015
#define _AUBADEVCFG2_DSWDTPS_MASK                0x03E00000
#define _AUBADEVCFG2_DSWDTPS_LENGTH              0x00000005

#define _AUBADEVCFG2_DSWDTOSC_POSITION           0x0000001A
#define _AUBADEVCFG2_DSWDTOSC_MASK               0x04000000
#define _AUBADEVCFG2_DSWDTOSC_LENGTH             0x00000001

#define _AUBADEVCFG2_DSWDTEN_POSITION            0x0000001B
#define _AUBADEVCFG2_DSWDTEN_MASK                0x08000000
#define _AUBADEVCFG2_DSWDTEN_LENGTH              0x00000001

#define _AUBADEVCFG2_FDSEN_POSITION              0x0000001C
#define _AUBADEVCFG2_FDSEN_MASK                  0x10000000
#define _AUBADEVCFG2_FDSEN_LENGTH                0x00000001

#define _AUBADEVCFG2_UPLLFSEL_POSITION           0x0000001E
#define _AUBADEVCFG2_UPLLFSEL_MASK               0x40000000
#define _AUBADEVCFG2_UPLLFSEL_LENGTH             0x00000001

#define _AUBADEVCFG2_w_POSITION                  0x00000000
#define _AUBADEVCFG2_w_MASK                      0xFFFFFFFF
#define _AUBADEVCFG2_w_LENGTH                    0x00000020

#define _AUBADEVCFG1_FNOSC_POSITION              0x00000000
#define _AUBADEVCFG1_FNOSC_MASK                  0x00000007
#define _AUBADEVCFG1_FNOSC_LENGTH                0x00000003

#define _AUBADEVCFG1_DMTINTV_POSITION            0x00000003
#define _AUBADEVCFG1_DMTINTV_MASK                0x00000038
#define _AUBADEVCFG1_DMTINTV_LENGTH              0x00000003

#define _AUBADEVCFG1_FSOSCEN_POSITION            0x00000006
#define _AUBADEVCFG1_FSOSCEN_MASK                0x00000040
#define _AUBADEVCFG1_FSOSCEN_LENGTH              0x00000001

#define _AUBADEVCFG1_IESO_POSITION               0x00000007
#define _AUBADEVCFG1_IESO_MASK                   0x00000080
#define _AUBADEVCFG1_IESO_LENGTH                 0x00000001

#define _AUBADEVCFG1_POSCMOD_POSITION            0x00000008
#define _AUBADEVCFG1_POSCMOD_MASK                0x00000300
#define _AUBADEVCFG1_POSCMOD_LENGTH              0x00000002

#define _AUBADEVCFG1_OSCIOFNC_POSITION           0x0000000A
#define _AUBADEVCFG1_OSCIOFNC_MASK               0x00000400
#define _AUBADEVCFG1_OSCIOFNC_LENGTH             0x00000001

#define _AUBADEVCFG1_FCKSM_POSITION              0x0000000E
#define _AUBADEVCFG1_FCKSM_MASK                  0x0000C000
#define _AUBADEVCFG1_FCKSM_LENGTH                0x00000002

#define _AUBADEVCFG1_WDTPS_POSITION              0x00000010
#define _AUBADEVCFG1_WDTPS_MASK                  0x001F0000
#define _AUBADEVCFG1_WDTPS_LENGTH                0x00000005

#define _AUBADEVCFG1_WDTSPGM_POSITION            0x00000015
#define _AUBADEVCFG1_WDTSPGM_MASK                0x00200000
#define _AUBADEVCFG1_WDTSPGM_LENGTH              0x00000001

#define _AUBADEVCFG1_WINDIS_POSITION             0x00000016
#define _AUBADEVCFG1_WINDIS_MASK                 0x00400000
#define _AUBADEVCFG1_WINDIS_LENGTH               0x00000001

#define _AUBADEVCFG1_FWDTEN_POSITION             0x00000017
#define _AUBADEVCFG1_FWDTEN_MASK                 0x00800000
#define _AUBADEVCFG1_FWDTEN_LENGTH               0x00000001

#define _AUBADEVCFG1_FWDTWINSZ_POSITION          0x00000018
#define _AUBADEVCFG1_FWDTWINSZ_MASK              0x03000000
#define _AUBADEVCFG1_FWDTWINSZ_LENGTH            0x00000002

#define _AUBADEVCFG1_DMTCNT_POSITION             0x0000001A
#define _AUBADEVCFG1_DMTCNT_MASK                 0x7C000000
#define _AUBADEVCFG1_DMTCNT_LENGTH               0x00000005

#define _AUBADEVCFG1_FDMTEN_POSITION             0x0000001F
#define _AUBADEVCFG1_FDMTEN_MASK                 0x80000000
#define _AUBADEVCFG1_FDMTEN_LENGTH               0x00000001

